We just upgraded to terraform 0.12.7 (from 0.11.13) and azurerm 1.34.0, other than that we changed *nothing*.

Now it forces aks recreation

```hcl
  # module.aks.azurerm_kubernetes_cluster.k8s must be replaced
-/+ resource "azurerm_kubernetes_cluster" "k8s" {
      - api_server_authorized_ip_ranges = [] -> null
        dns_prefix                      = "[REDACTED]"
      ~ enable_pod_security_policy      = false -> (known after apply)
      ~ fqdn                            = "[REDACTED]" -> (known after apply)
      ~ id                              = "[REDACTED]" -> (known after apply)
      ~ kube_admin_config               = [] -> (known after apply)
      + kube_admin_config_raw           = (sensitive value)
      ~ kube_config                     = [
          - {
              - client_certificate     = "[REDACTED]"
              - client_key             = "[REDACTED]"
              - cluster_ca_certificate = "[REDACTED]"
              - host                   = "[REDACTED]"
              - password               = "[REDACTED]"
              - username               = "[REDACTED]"
            },
        ] -> (known after apply)
      ~ kube_config_raw                 = (sensitive value)
        kubernetes_version              = "1.12.8"
        location                        = "westus2"
        name                            = "[REDACTED]"
      ~ node_resource_group             = "[REDACTED]" -> (known after apply)
        resource_group_name             = "[REDACTED]"
        tags                            = {
            "env" = "ops"
        }

      ~ addon_profile {

          + http_application_routing { # forces replacement
              + enabled                            = false # forces replacement
              + http_application_routing_zone_name = (known after apply)
            }

          ~ oms_agent {
                enabled                    = true
              + log_analytics_workspace_id = "[REDACTED]"
            }
        }

      ~ agent_pool_profile {
          - availability_zones  = [] -> null
            count               = 6
          + dns_prefix          = (known after apply)
          - enable_auto_scaling = false -> null
          ~ fqdn                = "[REDACTED]" -> (known after apply)
          - max_count           = 0 -> null
          ~ max_pods            = 30 -> (known after apply)
          - min_count           = 0 -> null
            name                = "minion"
          - node_taints         = [] -> null
            os_disk_size_gb     = 200
            os_type             = "Linux"
            type                = "AvailabilitySet"
            vm_size             = "Standard_DS2_v2"
            vnet_subnet_id      = "[REDACTED]"
        }

        linux_profile {
            admin_username = "ubuntu"

            ssh_key {
                key_data = "[REDACTED]"
            }
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ load_balancer_sku  = "Basic" -> "basic"
            network_plugin     = "azure"
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
        }

        role_based_access_control {
            enabled = true
        }

      ~ service_principal {
            client_id     = "[REDACTED]"
          + client_secret = (sensitive value)
        }
    }

```